# DataFrame

In [ ]:
1. Creating a DataFrame
2. Creating DataFrame with column names
3. Insert values to DataFrame
4. Drop a row
5. Update row values based on condithon
6. Drop duplicates

## 1. Creating a DataFrame

In [6]:
import pandas as pd

# Create a data frame
df = pd.DataFrame()

print(df) # Now it has 0 rows and 0 columns

Empty DataFrame
Columns: []
Index: []

## 2. Creating DataFrame with column names

In [7]:
df = pd.DataFrame(columns=['Name', 'Age', 'salary'])

print(df) # Now we can observe the column names

Empty DataFrame
Columns: [Name, Age, salary]
Index: []

## 3. Insert values to DataFrame

In [8]:
df.loc[len(df.index)] = ("Rama Suresh Vijjana", 24, 21000)

print(df)

                  Name Age salary
0  Rama Suresh Vijjana  24  21000

In [9]:
df.loc[len(df.index)] = ["Eswar Bonam", 24, 21000]

display(df)

                  Name Age salary
0  Rama Suresh Vijjana  24  21000
1          Eswar Bonam  24  21000

In [10]:
df2 = pd.DataFrame([['Anand', 20, 0], ['Mahesh', 20, 0]], columns=['Name', 'Age', 'salary'])

df = df.append(df2, ignore_index= True) # df.append() is not inplace
display(df)

                  Name Age salary
0  Rama Suresh Vijjana  24  21000
1          Eswar Bonam  24  21000
2                Anand  20      0
3               Mahesh  20      0

## 4. Drop a row

In [11]:
df3 = df.drop([0, 1]) # Not inplace
display(df3)

df4 = df.drop(0) # Not inplace
display(df4)

     Name Age salary
2   Anand  20      0
3  Mahesh  20      0

          Name Age salary
1  Eswar Bonam  24  21000
2        Anand  20      0
3       Mahesh  20      0

In [12]:
df4 = df[df['salary'] == 0].index

df5 = df.drop(df4)
display(df5)

                  Name Age salary
0  Rama Suresh Vijjana  24  21000
1          Eswar Bonam  24  21000

## 5. Update row values based on condithon

In [13]:
df.loc[df.Name == 'Rama Suresh Vijjana', "Age"] = 25

print(df)

                  Name Age salary
0  Rama Suresh Vijjana  25  21000
1          Eswar Bonam  24  21000
2                Anand  20      0
3               Mahesh  20      0

In [14]:
df.loc[df.Name == 'Rama Suresh Vijjana', ['Name',"Age",'salary']] = ['anand',20,0]

print(df)

          Name Age salary
0        anand  20      0
1  Eswar Bonam  24  21000
2        Anand  20      0
3       Mahesh  20      0

## 6. Drop duplicates

In [ ]:
1. df.drop_duplicates()  is case sensitive

In [15]:
df.loc[len(df.index)] = ('Anand', 20, 0)

print(df)

          Name Age salary
0        anand  20      0
1  Eswar Bonam  24  21000
2        Anand  20      0
3       Mahesh  20      0
4        Anand  20      0

In [16]:
# Deleting dupolicate rows
# it not delete the 0 index row even if it is duplicate
df = df.drop_duplicates() #NOT INPLACE
display(df)

          Name Age salary
0        anand  20      0
1  Eswar Bonam  24  21000
2        Anand  20      0
3       Mahesh  20      0

### Rough

In [28]:
df.loc[df.Name == None, 'salary'] = 22000

In [30]:
df.loc[3]

Name      Mahesh
Age           20
salary         0
Name: 3, dtype: object

In [34]:
df[df.Name == 'Anand'].salary = 500

C:\Users\RAMU\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [35]:
print(df)

          Name Age salary
0        anand  20      0
1  Eswar Bonam  24  21000
2        Anand  20  22000
3       Mahesh  20      0